#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
        id       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm"
      - location = "eastus" -> null
      - name     = "rg-windows-vm" -> null
        tags     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
    }

  # azurerm_storage_account.bootdiag has been deleted
  - resource "azurerm_storage_account" "bootdiag" {
        id                                = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Storage/storageAccounts/bootdiag0pncr02i"
        name                              = "bootdiag0pncr02i"
      - primary_blob_endpoint             = "https://bootdiag0pncr02i.blob.core.windows.net/" -> null
        tags                              = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.network.azurerm_network_security_group.main has been deleted
  - resource "azurerm_network_security_group" "main" {
      - id                  = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Network/networkSecurityGroups/nsg-rg-windows-vm" -> null
        name                = "nsg-rg-windows-vm"
        tags                = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (3 unchanged attributes hidden)
    }

  # module.network.azurerm_public_ip.main has been deleted
  - resource "azurerm_public_ip" "main" {
      - id                      = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Network/publicIPAddresses/pip-rg-windows-vm" -> null
        name                    = "pip-rg-windows-vm"
        tags                    = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (11 unchanged attributes hidden)
    }

  # module.network.azurerm_virtual_network.main has been deleted
  - resource "azurerm_virtual_network" "main" {
      - id                             = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Network/virtualNetworks/vnet-rg-windows-vm" -> null
      - name                           = "vnet-rg-windows-vm" -> null
        tags                           = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm.azurerm_network_interface.main has been deleted
  - resource "azurerm_network_interface" "main" {
      - id                             = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Network/networkInterfaces/nic-rg-windows-vm" -> null
        name                           = "nic-rg-windows-vm"
        tags                           = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vm.azurerm_windows_virtual_machine.main has been deleted
  - resource "azurerm_windows_virtual_machine" "main" {
      - id                                                     = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Compute/virtualMachines/vm-rg-windows-vm" -> null
      - name                                                   = "vm-rg-windows-vm" -> null
        tags                                                   = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (29 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-windows-vm"
      + tags     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # azurerm_storage_account.bootdiag will be created
  + resource "azurerm_storage_account" "bootdiag" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "bootdiag0pncr02i"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-windows-vm"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.network.azurerm_network_security_group.main will be created
  + resource "azurerm_network_security_group" "main" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-rg-windows-vm"
      + resource_group_name = "rg-windows-vm"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.network.azurerm_public_ip.main will be created
  + resource "azurerm_public_ip" "main" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-rg-windows-vm"
      + resource_group_name     = "rg-windows-vm"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.network.azurerm_subnet.main["0"] will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-0"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-windows-vm"
      + virtual_network_name                          = "vnet-rg-windows-vm"
    }

  # module.network.azurerm_subnet.main["1"] will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-1"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-windows-vm"
      + virtual_network_name                          = "vnet-rg-windows-vm"
    }

  # module.network.azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "vnet-rg-windows-vm"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-windows-vm"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.vm.azurerm_managed_disk.additional will be created
  + resource "azurerm_managed_disk" "additional" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 128
      + id                                = (known after apply)
      + location                          = "eastus"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "additionaldisk-rg-windows-vm"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-windows-vm"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Standard_LRS"
      + tier                              = (known after apply)
    }

  # module.vm.azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "nic-rg-windows-vm"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-windows-vm"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vm.azurerm_virtual_machine_data_disk_attachment.additional will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "additional" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 10
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.vm.azurerm_windows_virtual_machine.main will be created
  + resource "azurerm_windows_virtual_machine" "main" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-rg-windows-vm"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-windows-vm"
      + size                                                   = "Standard_B2s"
      + tags                                                   = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - public_ip_address                     = "74.235.48.5" -> null
  + resource_group_location               = "eastus"
  - storage_account_primary_blob_endpoint = "https://bootdiag0pncr02i.blob.core.windows.net/" -> null
  - vm_id                                 = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Compute/virtualMachines/vm-rg-windows-vm" -> null
  - vm_name                               = "vm-rg-windows-vm" -> null

```

</details>

*Plan generated at: 2026-02-17T09:58:53.800Z*